In [2]:
import mysql.connector
from mysql.connector import Error
import pandas as pd

In [11]:
def create_server_connection(host_name, user_name, user_password):
    connection = None
    try:
        connection=mysql.connector.connect(
            host=host_name,
            user=user_name,
            passwd=user_password
        )
        print("Mysql Database connection Successful")
    except Error as err:
        print(f"Error:'{err}'")
    return connection
    
              
pw = "arun"

              
db = "mysql_python"
connection = create_server_connection("localhost","root",pw)

Mysql Database connection Successful

In [14]:
def create_database(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print("Database created successfully")
    except Error as err:
        print(f"Errot:'{err}'")
create_database_query = "Create database mysql_python"
create_database(connection,create_database_query)

Errot:'1007 (HY000): Can't create database 'mysql_python'; database exists'

In [16]:
def create_db_connection (host_name, user_name,user_password, db_name):
    connection=None
    try:
        connection = mysql.connector.connect(
            host =host_name,
            user=user_name,
            passwd = user_password,
            database = db_name)
        print("Mysql db connection successful")
    except Error as err:
        print (f"Error: {err}'")
    return connection

In [19]:
def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query) 
        connection.commit()
        print("Query was successful")
    except Error as err:
        print (f"Error: '{err}'")

In [21]:
create_orders_table = """
create table orders ( 
order_id int primary key, 
customer_name varchar(30) not null, 
product_name varchar(20) not null, 
date_ordered date, quantity int, 
unit_price float, 
phone_number varchar(20));
"""
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,create_orders_table)

Mysql db connection successful
Query was successful

In [27]:
data_orders = """
insert into orders values
(101, 'Steve', 'Laptop', '2018-06-12', 2, 800, '293730802'), 
(102,'Jos','Books', '2019-02-10', 10, 12, '367489124'), 
(103, 'Stacy', 'Trousers','19-12-25', 5, 50, '8976123645'), 
(184,'Nancy','T-Shirts', '2018-07-1', 7, 30, '368145099'), 
(105, 'Maria', 'Headphones', '2019-05-30', 6, 48, '8865316698'), 
(186, 'Danny', 'Smart TV', '2018-08-2', 10, 300,'7720130449');
"""
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,data_orders)

Mysql db connection successful
Query was successful

In [28]:
def read_query(connection, query):
    cursor = connection.cursor() 
    result = None
    try:
        cursor.execute(query) 
        result = cursor.fetchall() 
        return result 
    except Error as err: 
        print (f"Error: '{err}'")

In [29]:
q1="""
select * from orders;
"""
connection = create_db_connection("localhost","root",pw,db)
results=read_query(connection,q1)
for result in results:
    print(result)

Mysql db connection successful
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '293730802')
(102, 'Jos', 'Books', datetime.date(2019, 2, 10), 10, 12.0, '367489124')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 50.0, '8976123645')
(105, 'Maria', 'Headphones', datetime.date(2019, 5, 30), 6, 48.0, '8865316698')
(184, 'Nancy', 'T-Shirts', datetime.date(2018, 7, 1), 7, 30.0, '368145099')
(186, 'Danny', 'Smart TV', datetime.date(2018, 8, 2), 10, 300.0, '7720130449')

In [31]:
q3="""
select year(date_ordered) from orders;
"""
connection = create_db_connection("localhost","root",pw,db)
results=read_query(connection,q3)
for result in results:
    print(result)

Mysql db connection successful
(2018,)
(2019,)
(2019,)
(2019,)
(2018,)
(2018,)

In [35]:
q5="""
select * from orders where date_ordered > 2018-12-31;
"""
connection = create_db_connection("localhost","root",pw,db)
results=read_query(connection,q5)
for result in results:
    print(result)

Mysql db connection successful
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '293730802')
(102, 'Jos', 'Books', datetime.date(2019, 2, 10), 10, 12.0, '367489124')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 50.0, '8976123645')
(105, 'Maria', 'Headphones', datetime.date(2019, 5, 30), 6, 48.0, '8865316698')
(184, 'Nancy', 'T-Shirts', datetime.date(2018, 7, 1), 7, 30.0, '368145099')
(186, 'Danny', 'Smart TV', datetime.date(2018, 8, 2), 10, 300.0, '7720130449')

In [36]:
q7="""
select * from orders order by unit_price;
"""
connection = create_db_connection("localhost","root",pw,db)
results=read_query(connection,q7)
for result in results:
    print(result)

Mysql db connection successful
(102, 'Jos', 'Books', datetime.date(2019, 2, 10), 10, 12.0, '367489124')
(184, 'Nancy', 'T-Shirts', datetime.date(2018, 7, 1), 7, 30.0, '368145099')
(105, 'Maria', 'Headphones', datetime.date(2019, 5, 30), 6, 48.0, '8865316698')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 50.0, '8976123645')
(186, 'Danny', 'Smart TV', datetime.date(2018, 8, 2), 10, 300.0, '7720130449')
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '293730802')

In [38]:
from_db = []

for result in results:
    result = list (result)
    from_db.append(result) 
columns = ["order_id", "customer_name", "product_name", "date_ordered", "quantity","unit_price", "phone_number"]

df = pd.DataFrame (from_db, columns = columns)

display (df)

,order_id,customer_name,product_name,date_ordered,quantity,unit_price,phone_number
0,102,Jos,Books,2019-02-10,10,12.0,367489124
1,184,Nancy,T-Shirts,2018-07-01,7,30.0,368145099
2,105,Maria,Headphones,2019-05-30,6,48.0,8865316698
3,103,Stacy,Trousers,2019-12-25,5,50.0,8976123645
4,186,Danny,Smart TV,2018-08-02,10,300.0,7720130449
5,101,Steve,Laptop,2018-06-12,2,800.0,293730802

In [39]:
delete_order ="""
delete from orders
where order_id =105;
"""
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,delete_order)

Mysql db connection successful
Query was successful

In [40]:
q9="""
select * from orders;
"""
connection = create_db_connection("localhost","root",pw,db)
results=read_query(connection,q9)
for result in results:
    print(result)

Mysql db connection successful
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '293730802')
(102, 'Jos', 'Books', datetime.date(2019, 2, 10), 10, 12.0, '367489124')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 50.0, '8976123645')
(184, 'Nancy', 'T-Shirts', datetime.date(2018, 7, 1), 7, 30.0, '368145099')
(186, 'Danny', 'Smart TV', datetime.date(2018, 8, 2), 10, 300.0, '7720130449')